
#include <stdio.h>
#include <unistd.h>
#include <fcntl.h>
#include <stdlib.h>
#include <sys/time.h>
#include <sys/stat.h>
#include <time.h>
#include <cstring>

/* UDP server */
#include <sys/socket.h>
#include <ifaddrs.h>
#include <netdb.h>
#include <sys/ioctl.h>
#include <net/if.h>	//ifconfig down/up

#ifdef _AF_XDP
/* AF_XDP server */
#include <xdp/libxdp.h>
#include <bpf/bpf.h>
#include <xdp/xsk.h>
#include <sys/resource.h> //rlimit
#include <assert.h>
#include <sched.h>
#include <netinet/udp.h>
#include <netinet/ip.h>
#include <netinet/ether.h>
#include <linux/if_link.h> //DRV_MODE
#endif

#include "../../hardware.h"
#include "../../shmem.h"
#include "../../spi.h"

#include "logo.h"
#include "pll.h"
#include "utils.h"

// FPGA SPI commands
#define UIO_GET_GROOVY_STATUS     0xf0
#define UIO_GET_GROOVY_HPS        0xf1
#define UIO_SET_GROOVY_INIT       0xf2
#define UIO_SET_GROOVY_SWITCHRES  0xf3
#define UIO_SET_GROOVY_BLIT       0xf4
#define UIO_SET_GROOVY_LOGO       0xf5
#define UIO_SET_GROOVY_AUDIO      0xf6
#define UIO_SET_GROOVY_BLIT_LZ4   0xf7

// FPGA DDR shared
#define BASEADDR 0x1C000000
#define HEADER_LEN 0xff
#define CHUNK 7
#define HEADER_OFFSET HEADER_LEN - CHUNK
#define FRAMEBUFFER_SIZE  (720 * 576 * 4 * 2) // RGBA 720x576 with 2 fields
#define AUDIO_SIZE (8192 * 2 * 2)             // 8192 samples with 2 16bit-channels
#define LZ4_SIZE (720 * 576 * 4)              // Estimated LZ4 MAX
#define FIELD_OFFSET 0x195000                 // 0x12fcff position for fpga (after first field)
#define AUDIO_OFFSET 0x32a000                 // 0x25f8ff position for fpga (after framebuffer)
#define LZ4_OFFSET_A 0x332000                 // 0x2678ff position for fpga (after audio)
#define LZ4_OFFSET_B 0x4c7000                 // 0x3974ff position for fpga (after lz4_offset_A)
#define BUFFERSIZE FRAMEBUFFER_SIZE + AUDIO_SIZE + LZ4_SIZE + LZ4_SIZE + HEADER_LEN

// UDP server
#define UDP_PORT 32100
#define UDP_PORT_INPUTS 32101

#ifdef _AF_XDP
// XDP server
#define XDP_BASEADDR 0x15000000
#define XDP_NUM_FRAMES 65536 			     // pot 2 (min.4096)
#define XDP_FRAME_SIZE XSK_UMEM__DEFAULT_FRAME_SIZE
#define RX_BATCH_SIZE 64		     	     
#define INVALID_UMEM_FRAME UINT64_MAX
#endif

// GroovyMiSTer protocol
#define CMD_CLOSE 1
#define CMD_INIT 2
#define CMD_SWITCHRES 3
#define CMD_AUDIO 4
#define CMD_GET_STATUS 5
#define CMD_BLIT_VSYNC 6



//https://stackoverflow.com/questions/64318331/how-to-print-logs-on-both-console-and-file-in-c-language
#define LOG_TIMER 25
#define LOGO_TIMER 16
#define KEEP_ALIVE_FRAMES 45 * 60

static struct timespec logTS, logTS_ant, blitStart, blitStop;
static int doVerbose = 0;
static double difMs = 0;
static unsigned long logTime = 0;
static FILE * fp = NULL;

#define LOG(sev,fmt, ...) do {	\
			        if (sev == 0) printf(fmt, __VA_ARGS__);	\
			        if (sev <= doVerbose) { \
			        	clock_gettime(CLOCK_MONOTONIC, &logTS); \
			        	difMs = (difMs != 0) ? diff_in_ms(&logTS_ant, &logTS) : -1; \
					fprintf(fp, "[%06.3f]", difMs); \
					fprintf(fp, fmt, __VA_ARGS__);	\
                                	clock_gettime(CLOCK_MONOTONIC, &logTS_ant); \
                                } \
                           } while (0)

typedef union
{
  struct
  {
    unsigned char bit0 : 1;
    unsigned char bit1 : 1;
    unsigned char bit2 : 1;
    unsigned char bit3 : 1;
    unsigned char bit4 : 1;
    unsigned char bit5 : 1;
    unsigned char bit6 : 1;
    unsigned char bit7 : 1;
  }u;
   uint8_t byte;
} bitByte;


typedef struct {
   //frame sync
   uint32_t PoC_frame_recv;
   uint32_t PoC_frame_ddr;

   //modeline + pll -> burst 3
   uint16_t PoC_H; 	// 08
   uint8_t  PoC_HFP; 	// 10
   uint8_t  PoC_HS; 	// 11
   uint8_t  PoC_HBP; 	// 12
   uint16_t PoC_V; 	// 13
   uint8_t  PoC_VFP; 	// 15
   uint8_t  PoC_VS;     // 16
   uint8_t  PoC_VBP;    // 17

   //pll
   uint8_t  PoC_pll_M0;  // 18 High
   uint8_t  PoC_pll_M1;  // 19 Low
   uint8_t  PoC_pll_C0;  // 20 High
   uint8_t  PoC_pll_C1;  // 21 Low
   uint32_t PoC_pll_K;   // 22
   uint8_t  PoC_ce_pix;  // 26

   uint8_t  PoC_interlaced;
   uint8_t  PoC_FB_progressive;

   double   PoC_pclock;

   uint32_t PoC_buffer_offset; // FIELD/AUDIO/LZ4 position on DDR

   //framebuffer
   uint32_t PoC_bytes_len;
   uint32_t PoC_pixels_len;
   uint32_t PoC_bytes_recv;
   uint32_t PoC_pixels_ddr;
   uint32_t PoC_field_frame;
   uint8_t  PoC_field;

   double PoC_width_time;
   uint16_t PoC_V_Total;

   //audio
   uint32_t PoC_bytes_audio_len;

   //lz4
   uint32_t PoC_bytes_lz4_len;
   uint32_t PoC_bytes_lz4_ddr;
   uint8_t  PoC_field_lz4;

   //joystick
   uint32_t  PoC_joystick_keep_alive;
   uint8_t   PoC_joystick_order;
   uint32_t  PoC_joystick_map1;
   uint32_t  PoC_joystick_map2;

   char      PoC_joystick_l_analog_X1;
   char      PoC_joystick_l_analog_Y1;
   char      PoC_joystick_r_analog_X1;
   char      PoC_joystick_r_analog_Y1;

   char      PoC_joystick_l_analog_X2;
   char      PoC_joystick_l_analog_Y2;
   char      PoC_joystick_r_analog_X2;
